package Java2019_10_26;

/**
 * @ProjectName Study
 * @ClassName Test
 * Description
 * @Auther YunSW
 * @Date 2019/10/26 16:11
 * @Version 1.0
 *
 * 一、集合框架描述
 *     1、集合、数组都是对多个数据进行存储操作的结果，简称java容器
 *        说明：此时的存储，主要指的是内存层面的存储，不涉及到持久化的存储（.txt,jpg...)
 *     2、数组的存储
 *        2.1 特点：> 一旦初始化以后，其长度就确定了。
 *                  > 数组一旦定义好，其元素类型也就确定了。
 *        2.2 缺点：
 *                  > 初始化之后长度不可变
 *                  > 数组提供的方法有限，对于添加，删除，插入数据等操作，非常不便
 *                  > 获取数组中实际元素的个数需求，数组没有现成的属性和方法使用
 *                  > 数组存储数据的特点：有序、可重复。对于无序、不可重复的需求，不能满足
 * 二、集合的框架
 *     Collection接口：单列集合，用来存储一个一个的对象
 *                     List接口：存储有序的、可重复的数据  --->“动态”数组
 *                     Set接口：存储无序的、不可重复的     ---> 高中学的“集合”
 *            Map接口：双列集合，用来存储一对一对（key--value）的数据   ---> 数学中的函数
 *
 *
 **/
public class Test {

}
